tap "jesseduffield/lazygit"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "tursodatabase/tap"

brew "bat"
brew "carapace"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "eza"
brew "f3"
brew "fastfetch"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "glow"
brew "gnupg"
brew "go"
brew "htop"
brew "iperf3"
brew "jenv"
brew "jq"
brew "just"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "mactop"
brew "neovim"
brew "node"
brew "ripgrep"
brew "opencode"
brew "pnpm"
brew "resvg"
brew "starship"
brew "stow"
brew "tmux"
brew "wget"
brew "zoxide"

cask "1password@beta"
cask "nikitabobko/tap/aerospace"
cask "ghostty"
cask "helium-browser"
cask "mos@beta"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "stats"

go "github.com/air-verse/air"
go "github.com/melkeydev/go-blueprint"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
