tap "caarlos0/tap" if OS.mac?
tap "jesseduffield/lazygit"
tap "nikitabobko/tap" if OS.mac?

brew "bat"
brew "carapace"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "eza"
brew "f3"
brew "fastfetch"
brew "fd"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gnupg"
brew "go"
brew "gzip"
brew "htop"
brew "iperf3"
brew "jq"
brew "just"
brew "lazygit"
brew "libpq"
brew "luarocks"
brew "mactop" if OS.mac?
brew "neovim"
brew "node"
brew "ripgrep"
brew "opencode"
brew "openjdk@21"
brew "pinentry-mac" if OS.mac?
brew "pnpm"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "resvg"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "unzip"
brew "wget"
brew "zoxide"
brew "caarlos0/tap/timer" if OS.mac?

cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "nikitabobko/tap/aerospace" if OS.mac?
cask "brave-browser" if OS.mac?
cask "ghostty" if OS.mac?
cask "mos@beta" if OS.mac?
cask "orbstack" if OS.mac?
cask "raycast" if OS.mac?
cask "spotify" if OS.mac?
cask "stats" if OS.mac?
cask "zed" if OS.mac?

go "github.com/air-verse/air"
