tap "caarlos0/tap"
tap "felixkratz/formulae"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "supabase/tap"

brew "bat"
brew "carapace"
brew "chezmoi"
brew "eza"
brew "f3"
brew "fnm"
brew "fzf"
brew "glow"
brew "gnupg"
brew "iperf3"
brew "libpq"
brew "luarocks"
brew "mactop"
brew "neovim"
brew "openjdk@21"
brew "pinentry-mac"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "resvg"
brew "starship"
brew "stow"
brew "zoxide"

cask "1password"
cask "nikitabobko/tap/aerospace"
cask "brave-browser"
cask "ghostty"
cask "mos@beta"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "stats"
cask "zed"
